tests/artillery/config/environments.yaml
# Artillery Environment Configuration

# Development environment
config:
  environments:
    dev:
      target: "http://localhost:3001"
      phases:
        - duration: 30
          arrivalRate: 2
          name: "Warm up"
        - duration: 60
          arrivalRate: 5
          rampTo: 10
          name: "Ramp up load"
        - duration: 30
          arrivalRate: 10
          name: "Sustained load"
      variables:
        baseUrl: "/api/v1"
        authToken: "{{ $processEnvironment.AUTH_TOKEN }}"
        adminToken: "{{ $processEnvironment.ADMIN_TOKEN }}"

    # Staging environment
    staging:
      target: "https://staging-api.example.com"
      phases:
        - duration: 60
          arrivalRate: 10
          name: "Warm up"
        - duration: 180
          arrivalRate: 20
          rampTo: 50
          name: "Ramp up load"
        - duration: 120
          arrivalRate: 50
          name: "Sustained load"
        - duration: 60
          arrivalRate: 100
          name: "Spike test"
      variables:
        baseUrl: "/api/v1"
        authToken: "{{ $processEnvironment.AUTH_TOKEN }}"
        adminToken: "{{ $processEnvironment.ADMIN_TOKEN }}"